feat: more docs to the God of docs
